app/views/teams/_member_fields.html.erb

SELECT "members".* FROM "members" WHERE "members"."team_id" = $1  [["team_id", 1]]
---
                            <%= f.label :role, "Função" %>
                            <%= f.select :role, Member.roles.keys.map{|key, value| [key, key]} , {}, :class => 'form-control' %>