app/views/teams/index.html.erb

SELECT "members".* FROM "members" WHERE "members"."team_id" = $1  [["team_id", 5]]
SELECT COUNT(*) FROM "members" WHERE "members"."team_id" = $1  [["team_id", 5]]
---
                        <i class="mdi mdi-format-list-bulleted-type text-muted"></i>
                        <b><%= team.members.count%></b> Membros

SELECT "members".* FROM "members" WHERE "members"."team_id" = $1  [["team_id", 5]]
---
                <div class="avatar-group mb-3" id="tooltips-container">
                  <% team&.members&.each do |member| %>