app/views/games/_form.html.erb

    <%= form.label :first_team_id, "Equipa 1", style: "display: block" %>
    <%= form.select :first_team_id, Team.all.collect { |t| [t.name, t.id] }, {}, class: 'form-control select2', data:{controller:"select2"} %>
---
SELECT "teams".* FROM "teams"

    <%= form.label :second_team_id, "Equipa 2", style: "display: block" %>
    <%= form.select :second_team_id, Team.all.collect { |t| [t.name, t.id] }, {}, class: 'form-control' %>
---
SELECT "teams".* FROM "teams"