app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def success_payment
    activity_success = Activity.find(params[:id])
    payment = activity_success.payments.find_by(user_id: current_user.id)
    payment.update(status: "completed")
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "activities" SET "date_start" = $1, "date_end" = $2, "date_text" = $3, "updated_at" = $4, "description" = $5, "start_hour" = $6, "end_hour" = $7, "location" = $8 WHERE "activities"."id" = $9

  def participate_activity
    pay = Payment.new(method: "card", user_id: current_user.id , activity_id: params[:id])
    respond_to do |format|
      if pay.save
---
INSERT INTO "activities" ("name", "date_start", "date_end", "date_text", "price", "created_at", "updated_at", "kind", "description", "price_by", "start_hour", "end_hour", "location") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "payments" ("method", "user_id", "activity_id", "amount", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["method", "card"], ["user_id", 1], ["activity_id", 5], ["amount", 15.0], ["status", 0], ["created_at", "2024-11-16 19:42:08.537679"], ["updated_at", "2024-11-16 19:42:08.537679"]]

  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("name", "date_start", "date_end", "date_text", "price", "created_at", "updated_at", "kind", "description", "price_by", "start_hour", "end_hour", "location") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @activity.update(activity_params)
---
UPDATE "activities" SET "date_start" = $1, "date_end" = $2, "date_text" = $3, "updated_at" = $4, "description" = $5, "start_hour" = $6, "end_hour" = $7, "location" = $8 WHERE "activities"."id" = $9

  def destroy
    @activity.destroy!
---
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 1]]

    def set_activity
      @activity = Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]