app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT "games".* FROM "games"

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("first_team_id", "second_team_id", "result", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_team_id", 2], ["second_team_id", 1], ["result", ""], ["status", nil], ["created_at", "2024-09-07 12:11:11.662073"], ["updated_at", "2024-09-07 12:11:11.662073"]]

  def update
    respond_to do |format|
      if @game.update(game_params)
---
UPDATE "games" SET "result" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["result", "1:1"], ["updated_at", "2024-09-07 12:26:51.353175"], ["id", 1]]

    def set_game
      @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]