app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = $1  [["user_id", 1]]
---
  def index
    if params[:user] == "current"
      @teams = current_user.teams.all

INSERT INTO "teams" ("name", "image", "status", "created_at", "updated_at", "description", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Spartacus"], ["image", nil], ["status", nil], ["created_at", "2024-09-05 14:29:49.188408"], ["updated_at", "2024-09-05 14:29:49.188408"], ["description", ""], ["user_id", 1]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

UPDATE "teams" SET "updated_at" = $1, "description" = $2 WHERE "teams"."id" = $3  [["updated_at", "2024-09-05 12:52:21.132812"], ["description", ""], ["id", 1]]
---
  def update
    respond_to do |format|
      if @team.update(team_params)

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_team
      @team = Team.find(params[:id])