app/models/payment.rb

SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_amount
        activity_id = self.activity_id
        self.amount = 0
        activity = Activity.find(activity_id)