app/views/activities/show.html.erb

SELECT "payments".* FROM "payments" WHERE "payments"."activity_id" = $1 AND "payments"."user_id" = $2 LIMIT $3  [["activity_id", 6], ["user_id", 1], ["LIMIT", 1]]
---

          <% if !@activity.payments.exists?(user_id: current_user.id)%>